---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElevationSketchNotAllowed
source: html/7d1951d0-2339-962f-3714-8f07b90b8362.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElevationSketchNotAllowed Property

Wall in a family can't have an elevation profile.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElevationSketchNotAllowed { get; }
```